In [3]:
import pandas as pd
df = pd.read_csv('tips.csv')
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

In [4]:
df.head(3)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3

In [5]:
df.sample(5)

     total_bill   tip     sex smoker  day    time  size
176       17.89  2.00    Male    Yes  Sun  Dinner     2
178        9.60  4.00  Female    Yes  Sun  Dinner     2
108       18.24  3.76    Male     No  Sat  Dinner     2
158       13.39  2.61  Female     No  Sun  Dinner     2
225       16.27  2.50  Female    Yes  Fri   Lunch     2

In [7]:
df.shape

(244, 7)

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 244 entries, 0 to 243
Data columns (total 7 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   total_bill  244 non-null    float64
 1   tip         244 non-null    float64
 2   sex         244 non-null    object
 3   smoker      244 non-null    object
 4   day         244 non-null    object
 5   time        244 non-null    object
 6   size        244 non-null    int64
dtypes: float64(2), int64(1), object(4)
memory usage: 13.5+ KB

In [ ]:
day_wise_tips = df['day'].value_counts(sort=True, ascending=False)
day_wise_tips #more tips on sat, sun

day
Sat     87
Sun     76
Thur    62
Fri     19
Name: count, dtype: int64

In [14]:
df.describe()

       total_bill         tip        size
count  244.000000  244.000000  244.000000
mean    19.785943    2.998279    2.569672
std      8.902412    1.383638    0.951100
min      3.070000    1.000000    1.000000
25%     13.347500    2.000000    2.000000
50%     17.795000    2.900000    2.000000
75%     24.127500    3.562500    3.000000
max     50.810000   10.000000    6.000000

In [17]:
# Missing values
df.isnull().sum()

total_bill    0
tip           0
sex           0
smoker        0
day           0
time          0
size          0
dtype: int64

In [18]:
df.sort_values(by='tip')

     total_bill    tip     sex smoker   day    time  size
92         5.75   1.00  Female    Yes   Fri  Dinner     2
111        7.25   1.00  Female     No   Sat  Dinner     1
67         3.07   1.00  Female    Yes   Sat  Dinner     1
236       12.60   1.00    Male    Yes   Sat  Dinner     2
0         16.99   1.01  Female     No   Sun  Dinner     2
..          ...    ...     ...    ...   ...     ...   ...
141       34.30   6.70    Male     No  Thur   Lunch     6
59        48.27   6.73    Male     No   Sat  Dinner     4
23        39.42   7.58    Male     No   Sat  Dinner     4
212       48.33   9.00    Male     No   Sat  Dinner     4
170       50.81  10.00    Male    Yes   Sat  Dinner     3

[244 rows x 7 columns]

In [20]:
df['tip'].unique()

array([ 1.01,  1.66,  3.5 ,  3.31,  3.61,  4.71,  2.  ,  3.12,  1.96,
        3.23,  1.71,  5.  ,  1.57,  3.  ,  3.02,  3.92,  1.67,  3.71,
        3.35,  4.08,  2.75,  2.23,  7.58,  3.18,  2.34,  4.3 ,  1.45,
        2.5 ,  2.45,  3.27,  3.6 ,  3.07,  2.31,  2.24,  2.54,  3.06,
        1.32,  5.6 ,  6.  ,  2.05,  2.6 ,  5.2 ,  1.56,  4.34,  3.51,
        1.5 ,  1.76,  6.73,  3.21,  1.98,  3.76,  2.64,  3.15,  2.47,
        1.  ,  2.01,  2.09,  1.97,  3.14,  2.2 ,  1.25,  3.08,  4.  ,
        2.71,  3.4 ,  1.83,  2.03,  5.17,  5.85,  3.25,  4.73,  3.48,
        1.64,  4.06,  4.29,  2.55,  5.07,  1.8 ,  2.92,  1.68,  2.52,
        4.2 ,  1.48,  2.18,  2.83,  6.7 ,  2.3 ,  1.36,  1.63,  1.73,
        2.74,  5.14,  3.75,  2.61,  4.5 ,  1.61, 10.  ,  3.16,  5.15,
        3.11,  3.55,  3.68,  5.65,  6.5 ,  4.19,  2.56,  2.02,  1.44,
        3.41,  5.16,  9.  ,  1.1 ,  3.09,  1.92,  1.58,  2.72,  2.88,
        3.39,  1.47,  1.17,  4.67,  5.92,  1.75])

In [21]:
df['tip'].nunique()

123

In [23]:
df['tip'] > 5

0      False
1      False
2      False
3      False
4      False
       ...
239     True
240    False
241    False
242    False
243    False
Name: tip, Length: 244, dtype: bool

In [28]:
df['sex'].value_counts() # male give more tips

sex
Male      157
Female     87
Name: count, dtype: int64

In [29]:
tip_more_than_5 = df[df['tip'] > 5]
tip_more_than_5

     total_bill    tip     sex smoker   day    time  size
23        39.42   7.58    Male     No   Sat  Dinner     4
44        30.40   5.60    Male     No   Sun  Dinner     4
47        32.40   6.00    Male     No   Sun  Dinner     4
52        34.81   5.20  Female     No   Sun  Dinner     4
59        48.27   6.73    Male     No   Sat  Dinner     4
85        34.83   5.17  Female     No  Thur   Lunch     4
88        24.71   5.85    Male     No  Thur   Lunch     2
116       29.93   5.07    Male     No   Sun  Dinner     4
141       34.30   6.70    Male     No  Thur   Lunch     6
155       29.85   5.14  Female     No   Sun  Dinner     5
170       50.81  10.00    Male    Yes   Sat  Dinner     3
172        7.25   5.15    Male    Yes   Sun  Dinner     2
181       23.33   5.65    Male    Yes   Sun  Dinner     2
183       23.17   6.50    Male    Yes   Sun  Dinner     4
211       25.89   5.16    Male    Yes   Sat  Dinner     4
212       48.33   9.00    Male     No   Sat  Dinner     4
214       28.17   6.50  Female    Yes   Sat  Dinner     3
239       29.03   5.92    Male     No   Sat  Dinner     3

In [ ]:
tip_more_than_5['day'].value_counts() #more tips are on sun, sat

day
Sun     8
Sat     7
Thur    3
Name: count, dtype: int64

In [43]:
tip_more_than_5['time'].value_counts()

time
Dinner    15
Lunch      3
Name: count, dtype: int64

In [44]:
df['time'].value_counts()

time
Dinner    176
Lunch      68
Name: count, dtype: int64

In [47]:
df['tip per person'] = df['tip'] / df['size']
df.sample(10)

     total_bill   tip     sex smoker   day    time  size  tip per person
9         14.78  3.23    Male     No   Sun  Dinner     2        1.615000
194       16.58  4.00    Male    Yes  Thur   Lunch     2        2.000000
62        11.02  1.98    Male    Yes   Sat  Dinner     2        0.990000
178        9.60  4.00  Female    Yes   Sun  Dinner     2        2.000000
6          8.77  2.00    Male     No   Sun  Dinner     2        1.000000
3         23.68  3.31    Male     No   Sun  Dinner     2        1.655000
103       22.42  3.48  Female    Yes   Sat  Dinner     2        1.740000
112       38.07  4.00    Male     No   Sun  Dinner     3        1.333333
65        20.08  3.15    Male     No   Sat  Dinner     3        1.050000
91        22.49  3.50    Male     No   Fri  Dinner     2        1.750000

In [50]:
df['tip_percentage'] = df['tip'] / df['total_bill'] * 100
df.sample(10)

,total_bill,tip,sex,smoker,day,time,size,tip per person,tip_percentage
22,15.77,2.23,Female,No,Sat,Dinner,2,1.115,14.140774
72,26.86,3.14,Female,Yes,Sat,Dinner,2,1.570,11.690246
97,12.03,1.50,Male,Yes,Fri,Dinner,2,0.750,12.468828
232,11.61,3.39,Male,No,Sat,Dinner,2,1.695,29.198966
243,18.78,3.00,Female,No,Thur,Dinner,2,1.500,15.974441
110,14.00,3.00,Male,No,Sat,Dinner,2,1.500,21.428571
47,32.40,6.00,Male,No,Sun,Dinner,4,1.500,18.518519
113,23.95,2.55,Male,No,Sun,Dinner,2,1.275,10.647182
195,7.56,1.44,Male,No,Thur,Lunch,2,0.720,19.047619
178,9.60,4.00,Female,Yes,Sun,Dinner,2,2.000,41.666667

In [ ]:
df['tip_percentage'].mean() # tip is 16% of the total bill on average

np.float64(16.08025817225047)

In [48]:
df['smoker'].value_counts()

smoker
No     151
Yes     93
Name: count, dtype: int64

In [72]:
df_2 = df[df['day'] == 'Sat']
df_2['tip_percentage'].mean()

np.float64(15.315171638777816)